Repository: mozilla-l10n/mt-training-data
Catalog: bn-BD/bn-BD_pontoon.tmx
Source language: en_us
Languages: bn_bd

source: The name and source location of the sampled function.
bn_bd: নমুনা ফাংশনটির নাম এবং উৎসের অবস্থান।

source: The name of the add-on
bn_bd: এড-অনের নাম

source: The name of the file (should have a ‘.png’ extension) to which we write the screenshot.
bn_bd: ফাইলে নাম (.png এক্সটেনশনযুক্ত) যাতে আমরা স্ক্রীনশট লিখব।

source: The name of the setting to alter.
bn_bd: সেটিং এর নাম পরিবর্তন করুন।

source: The name of the setting to display
bn_bd: সেটিং নামের প্রদর্শন করুন

source: The name of the setting to reset to the system default value
bn_bd: সিস্টেম পূর্বনির্ধারিত মানে সেটিং এর নাম পুনঃনির্ধারণ করুন

source: The name of this group
bn_bd: এই গ্রুপের নাম

source: The new value for the specified setting
bn_bd: সুনির্দিষ্ট সেটিং এর জন্য নতুন মান

source: The next protocol negotiation extension was enabled, but the callback was cleared prior to being needed.
bn_bd: পরবর্তী প্রোটোকল আপস এক্সটেনশন সক্রিয় করা হত, কিন্তু কলব্যাক পূর্বে প্রয়োজন হচ্ছে সাফ করা হয়েছিল।

source: The non-standard mozGetAsFile method is deprecated and will soon be removed. Use the standard toBlob method instead.
bn_bd: নন-স্ট্যান্ডার্ড mozGetAsFile মেথড অসমর্থিত এবং শীগ্রই তা অপসারণ করা হবে। এর পরিবর্তে স্ট্যান্ডার্ড toBlob মেথড ব্যবহার করুন।

source: The number of bytes taken up by this group, excluding subgroups
bn_bd: বাইটের সংখ্যা এই গ্রুপ থেকে নেয়া হয়েছে, সাবগ্রুপ ব্যতীত

source: The number of bytes taken up by this group, including subgroups
bn_bd: বাইটের সংখ্যা এই গ্রুপ থেকে নেয়া হয়েছে, সাবগ্রুপ ব্যতীত

source: The number of chars with which to indent each line
bn_bd: অক্ষরের সংখ্যা যা প্রতিটি ইন্ডেন্ট লাইনের সাথে

source: The number of Object allocations sampled at this location.
bn_bd: এই অবস্থানে বরাদ্দকৃত অবজেক্ট নমুনার সংখ্যা

source: The number of reachable objects in this group, excluding subgroups
bn_bd: গ্রহনযোগ্য অবজেক্টের সংখ্যা এই গ্রুপ থেকে নেয়া হয়েছে, সাবগ্রুপ ব্যতীত

source: The number of reachable objects in this group, including subgroups
bn_bd: গ্রহনযোগ্য অবজেক্টের সংখ্যা এই গ্রুপ থেকে নেয়া হয়েছে, সাবগ্রুপ ব্যতীত

source: The number of times this function was on the stack when the profiler took a sample.
bn_bd: যখন প্রোফাইলার একটি নমুনা নিল, এই ফাংশন কিছু সময়ের জন্য স্ট্যাক-এ ছিল।

source: The OCSP response cannot be fully decoded; it is of an unknown type.
bn_bd: OCSP উত্তরটি পুরোপুরি ডিকোড করা যায়নি; এটি অজানা ধরনের।

source: The OCSP response contains out-of-date information.
bn_bd: OCSP উত্তরটিতে বাতিল হওয়া তথ্য আছে।

source: The OCSP response does not include a status for the certificate being verified.
bn_bd: OCSP টি প্রতিক্রিয়া সার্টিফিকেটের জন্য একটি অবস্থা যাচাই করা হচ্ছে অন্তর্ভুক্ত নয়।

source: The OCSP response is not yet valid (contains a date in the future).
bn_bd: OCSP উত্তর এখনও সেট করা হয়নি (এতে ভবিষ্যতের তারিখ আছে)।

source: The OCSP server experienced an internal error.
bn_bd: OCSP সার্ভার একটি অভ্যন্তরীন ত্রুটির সম্মুখীন হয়েছে।

source: The OCSP server found the request to be corrupted or improperly formed.
bn_bd: OCSP সার্ভার দ্বারা অনুরোধটি নষ্ট বা অনুপযুক্ত হিসেবে চিহ্নিত হয়েছে।

source: The OCSP server has no status for the certificate.
bn_bd: OCSP সার্ভারের এই সার্টিফিকেটের জন্য কোনো অবস্থা নেই।

source: The OCSP server has refused this request as unauthorized.
bn_bd: OCSP সার্ভার এই অনুরোধটিকে অননুমোদিত হিসেবে প্রত্যাখ্যান করেছে।

source: The OCSP server requires a signature on this request.
bn_bd: OCSP সার্ভার এই অনুরোধটিতে একটি সাক্ষর চাচ্ছে।

source: The OCSP server returned an unrecognizable status.
bn_bd: OCSP সার্ভার একটি অচেনা অবস্থা পাঠিয়েছে।

source: The OCSP server returned unexpected/invalid HTTP data.
bn_bd: OCSP সার্ভার অপ্রত্যাশিত/অকার্যকর HTTP ডাটা প্রেরণ করেছে।

source: The OCSP server suggests trying again later.
bn_bd: OCSP সার্ভার পরবর্তীতে আবার চেষ্টা করার পরামর্শ দিচ্ছে।

source: The operation failed because the PKCS#11 token is not logged in.
bn_bd: PKCS#11 টোকেন লগইন করা নেই বলে অপারেশনটি ব্যর্থ হয়েছে।

source: The operation timed out when attempting to contact %S.
bn_bd: %S এর সাথে সংযোগ করার নির্ধারিত সময়সীমা পার হয়ে গেছে।

source: The owner of %S has configured their website improperly. To protect your information from being stolen, the connection to this website has not been established.
bn_bd: %S এর মালিক তাদের ওয়েবসাইটটি ত্রুটিপূর্ণভাবে কনফিগার করেছেন। আপনার তথ্য চুরি হয়ে যাওয়া থেকে রক্ষা করতে, এই ওয়েবসাইটটির সাথে যুক্ত হয়নি।

source: The owner of <span class='hostname'/> has configured their website improperly. To protect your information from being stolen, &brandShortName; has not connected to this website.
bn_bd: <span class='hostname'/> এর মালিক তাদের ওয়েবসাইটটি ত্রুটিপূর্ণভাবে কনফিগার করেছেন। আপনার তথ্যকে চুরি হয়ে যাওয়া থেকে বাঁচানোর জন্য &brandShortName; ওয়েবসাইটটির সাথে যুক্ত করা হয়নি।

source: The page at %S says:
bn_bd: %S-এ অবস্থিত পৃষ্ঠার বক্তব্য:

source: The page has been navigated to a new document.
bn_bd: পৃষ্ঠাটি নতুন ডকুমেন্টে চলে গিয়েছে।

source: The page isn’t redirecting properly
bn_bd: পৃষ্ঠাটি সঠিকভাবে রিডিরেক্ট হচ্ছে না

source: The page’s settings blocked the loading of a resource: %1$S
bn_bd: এই পৃষ্ঠার সেটিংস একটি রিসোর্সকে লোড হতে দিচ্ছে না : %1$S

source: The page’s settings blocked the loading of a resource at %2$S (“%1$S”).
bn_bd: এই পৃষ্ঠার সেটিংস %2$S এ অবস্থিত একটি রিসোর্সকে লোড হতে বাধা দিয়েছে("%1$S")।

source: The page’s settings observed the loading of a resource at %2$S (“%1$S”). A CSP report is being sent.
bn_bd: পৃষ্ঠার সেটিং %2$S ("%1$S") এ একটি রিসোর্সের লোড হওয়ার ঘটনা লক্ষ্য করেছে। একটি CSP রিপোর্ট পাঠানো হচ্ছে।

source: the page to be able to debug &lt;canvas&gt; contexts.
bn_bd: পৃষ্ঠাটি &lt;ক্যানভাস&gt; কন্টেক্সট ডিবাগ করতে সক্ষম হবে।

source: the page to be able to edit GLSL code.
bn_bd: এই পেজটি GLSL কোড সম্পাদন করতে সক্ষম।

source: the page to see detailed information about network activity.
bn_bd: পেজটি নেটওয়ার্ক কার্যকলাপ সম্পর্কে বিস্তারিত তথ্য দেখার জন্য।

source: the page to view and edit the audio context.
bn_bd: অডিও কনটেক্সট দেখতে এবং সম্পাদনা করতে এই পৃষ্ঠাটি।

source: The page was reloaded, because the character encoding declaration of the HTML document was not found when prescanning the first 1024 bytes of the file. The encoding declaration needs to be moved to be within the first 1024 bytes of the file.
bn_bd: পৃষ্ঠা পুনরায় লোড করা হয়েছিল কারণ ফাইলের প্রথম 1024 বাইটের যখন প্রিস্ক্যানিং করা হয় তখন HTML ডকুমেন্টের অক্ষরের এনকোডিং বিবৃতি পাওয়া যায়নি। ফাইলের প্রথম 1024 বাইটের মধ্যে এনকোডিং বিবৃতি স্থানান্তর করা প্রয়োজন।

source: The page you are trying to view cannot be shown because it is contained in a file type that may not be safe to open. Please contact the website owners to inform them of this problem.
bn_bd: আপনি যে পৃষ্ঠাটি দেখতে চাচ্ছেন তা প্রদর্শন করা সম্ভব নয় কারণ এতে এমন এক ধরনের ফাইল রয়েছে যেটি বিপজ্জনক হতে পারে। অনুগ্রহ করে এই সমস্যা সম্পর্কে ওয়েব-সাইট নির্মাতাদের অবগত করুন।

source: The page you are trying to view cannot be shown because it uses an invalid or unsupported form of compression.
bn_bd: আপনি যে পৃষ্ঠাটি দেখতে চাচ্ছেন তা প্রদর্শন করা সম্ভব নয় কারণ এটি অকার্যকর বা অসমর্থিত ধরনের কম্প্রেশন ব্যবহার করে।

source: The page you are viewing was encrypted before being transmitted over the Internet.
bn_bd: ইন্টারনেটের মাধ্যমে প্রেরণ করার পূর্বে, আপনার সামনে প্রদর্শিত পৃষ্ঠাটি এনক্রিপ্ট করা হয়েছিল।

source: The page you are viewing was not encrypted before being transmitted over the Internet.
bn_bd: ইন্টারনেটের মাধ্যমে প্রেরণ করার পূর্বে, আপনার সামনে প্রদর্শিত পৃষ্ঠাটি এনক্রিপ্ট করা হয় নাই।

source: The partial Update could not be applied. &brandShortName; will try again by downloading a complete Update.
bn_bd: আংশিক হালনাগাদ প্রয়োগ করা যায়নি। &brandShortName; সম্পূর্ণ হালনাগাদ ডাউনলোড করে আবার চেষ্টা করবে।

source: The password entered was incorrect.
bn_bd: উল্লেখিত পাসওয়ার্ড সঠিক নয়।

source: The password expired.
bn_bd: পাসওয়ার্ডের মেয়াদ শেষ।

source: The password is locked.
bn_bd: পাসওয়ার্ড লক করা আছে।

source: The path of the cookie to set
bn_bd: সেট করার জন্য কুকির পাথ

source: The peer tried to resume with an unexpected extended_master_secret extension.
bn_bd: একটি অপ্রত্যাশিত extended_master_secret extension সহ পিয়ার পুনরায় সচল করার চেষ্টা করেছিল।

source: The peer tried to resume without a correct extended_master_secret extension.
bn_bd: একটি সঠিক extended_master_secret extension ছাড়া পিয়ার পুনরায় সচল করার চেষ্টা করেছিল।

source: The peer used an unsupported combination of signature and hash algorithm.
bn_bd: পিয়ার একটি অসমর্থিত স্বাক্ষর এবং হ্যাস আ্যলগরিদমের সমাহার ব্যবহার করেছে ।

source: The percentage of time spent in this function and functions it calls.
bn_bd: এই ফাংশন কর্তিক এবং ফাংশনের পেছনে নির্দিষ্ট শতাংশ সময় ব্যয় হলো।

source: The percentage of time spent only within this function.
bn_bd: নির্দিষ্ট শতাংশ সময় শুধুমাত্র এই ফাংশনের পেছনে ব্যয় হলো।

source: The PKCS #12 operation failed for unknown reasons.
bn_bd: অজ্ঞাত কারণে PKCS #12 কাজটি ব্যর্থ হয়েছে।

source: The print job was aborted, or canceled.
bn_bd: মুদ্রণ অপ্রত্যাশিত ভাবে বন্ধ অথবা বাতিল করা হয়েছে।

source: The private key for this certificate cannot be found in key database
bn_bd: চিহ্নিত সার্টিফিকেটের প্রাইভেট কী এই কী ডাটাবেসের মধ্যে পাওয়া যায়নি।

source: The profile name “%S” is not allowed.
bn_bd: প্রোফাইলের নাম হিসাবে "%S" ব্যবহার করা যাবে না।

source: The profiler stores samples in a circular buffer, and once the buffer reaches the limit for a recording, newer samples begin to overwrite samples at the beginning of the recording.
bn_bd: প্রোফাইলার একটি বিজ্ঞপ্তি বাফারে নমুনা সঞ্চয়, এবং বাফার একটি রেকর্ডিং জন্য সীমা ছুঁয়েছে, নতুন নমুনা রেকর্ডিং শুরুতে নমুনা মুছে ফেলা শুরু.

source: The project folder doesn’t exist
bn_bd: প্রোজেক্ট ফোল্ডারটি বিদ্যমান নেই

source: The project folder ends up being a file
bn_bd: একটি প্রকল্প ফোল্ডার একটি ফাইলসহ শেষ হবে

source: The protocol to be used
bn_bd: যে প্রটোকল ব্যবহৃত হবে

source: The proxy %2$S is requesting a username and password. The site says: “%1$S”
bn_bd: %2$S প্রক্সি ব্যবহারকারী নাম এবং পাসওয়ার্ড চেয়েছে। সাইটটি জানিয়েছে: "%1$S"

source: The proxy server is refusing connections
bn_bd: প্রক্সি সার্ভার সংযোগ প্রত্যাখ্যান করছে

source: The proxy server you have configured could not be found. Please check your proxy settings and try again.
bn_bd: আপনার কনফিগার করা প্রক্সি সার্ভারটি খুঁজে পাওয়া যায়নি। অনুগ্রহ করে আপনার প্রক্সি সেটিংস পরীক্ষা করে পুনরায় চেষ্টা করুন।

source: There are no add-ons of that type installed.
bn_bd: এই ধরনের কোন এড-অন ইনস্টল করা হয়নি।

source: There are no downloads.
bn_bd: কোন ডাউনলোড নেই।

source: There are no profiles yet.
bn_bd: এখন পর্যন্ত কোন প্রোফাইল নেই।

source: There are no snapshots yet.
bn_bd: কোন স্ন্যাপশট এখন পর্যন্ত নেই।

source: There are no updates available. &brandShortName; will check periodically for updates.
bn_bd: কোনো হালনাগাদ বিদ্যমান নেই। &brandShortName; নিয়মিতভাবে হালনাগাদের জন্য অনুসন্ধান করবে।

source: There are no updates available. Please check again later or enable &brandShortName;'s automatic update checking.
bn_bd: কোনো হালনাগাদ বিদ্যমান নেই। অনুগ্রহ করে আবার পরীক্ষা করুন অথবা &brandShortName; এর স্বয়ংক্রিয় হালনাগাদ সক্রিয় করুন।

source: There are one or more paused debuggers. Please resume the most-recently paused debugger first at: %S
bn_bd: এক বা একাধিক ডিবাগার স্থগিত করে দেওয়া আছে। দয়া করে প্রথমে সবচেয়ে সম্প্রতি স্থগিত ডিবাগার পুনরায় শুরু করুন: %S

source: There has been an error translating this page.
bn_bd: এই পাতা অনুবাদে একটি ত্রুটি হয়েছে।

source: There has been a relatively long time since the last incremental GC slice.
bn_bd: সর্বশেষ ক্রমবর্ধমান GC স্লাইস থেকে অপেক্ষাকৃত দীর্ঘ সময়।

source: There is already a command called ‘%S’
bn_bd: '%S' নামক একটি কমান্ড ইতোমধ্যে বিদ্যমান

source: There is already a toolbar with the name “%S”. Please enter a different name.
bn_bd: "%S" নামে ইতিমধ্যেই একটি টুলবার রয়েছে। অনুগ্রহ করে অন্য একটি নাম দিন।

source: There is not enough free memory to print.
bn_bd: মুদ্রণের জন্য যথেষ্ট পরিমান মুক্ত মেমরি নেই।

source: There is not enough room on the disk to save %S.\n\nRemove unnecessary files from the disk and try again, or try saving in a different location.
bn_bd: %S সংরক্ষণ করার জন্য প্রয়োজনীয় স্থান ডিস্কের মধ্যে অবশিষ্ট নেই।\n\nঅপ্রয়োজনীয় ফাইল মুছে পুনরায় চেষ্টা করুন অথবা কোনো পৃথক অবস্থানে সংরক্ষণ করার চেষ্টা করুন।

source: There is not sufficient memory to complete the action you requested.\n\nQuit some applications and try again.
bn_bd: আপনার অনুরোধ করা কাজ সম্পন্ন করার জন্য পর্যাপ্ত মেমরি নেই।\n\nকিছু চলমান অ্যাপ্লিকেশন বন্ধ করে পুনরায় চেষ্টা করুন।

source: The report URI (%1$S) should be an HTTP or HTTPS URI.
bn_bd: প্রতিবেদন URI (%1$S) HTTP অথবা HTTPS URI হতে হবে।

source: The requested certificate could not be found.
bn_bd: অনুরোধকৃত সার্টিফিকেট পাওয়া যায়নি।

source: The resource at “%1$S” was blocked because tracking protection is enabled.
bn_bd: ট্র্যাকিং সুরক্ষা সক্রিয় থাকায় এই "%1$S" রিসোর্স রোধ হয়ে গেছে।

source: The resource at “%1$S” was blocked by Safe Browsing.
bn_bd: “%1$S” এর রিসোর্স সমূহ নিরাপদ ব্রাউজিং দ্বারা প্রতিরোধ করা হয়েছে।

source: The resource from “%1$S” was blocked due to MIME type mismatch (X-Content-Type-Options: nosniff).
bn_bd: MIME type mismatch (X-Content-Type-Options: nosniff) এর কারণে “%1$S” হতে রিসোর্সটি ব্লক।

source: The response from the OCSP server was corrupted or improperly formed.
bn_bd: OCSP সার্ভারের উত্তরটি বিকৃত বা অনুপোযুক্ত ছিলো।

source: There was an API call to force garbage collection.
bn_bd: এখানে API কল আছে যা গার্বেজ কালেকশনকে জোর করা হয়েছে

source: There was an error downloading %1$S.
bn_bd: %1$S ডাউন করার সময় ত্রুটি।

source: There was an error installing %1$S.
bn_bd: %1$S ইনস্টল করার সময় ত্রুটি।

source: There was an error processing this snapshot.
bn_bd: স্ন্যাপসট প্রক্রিয়াকরণ করার সময় ত্রুটি দেখা গিয়েছিল।

source: There was an error while comparing snapshots.
bn_bd: স্ন্যাপসটের তুলনা করার সময় ত্রুটি দেখা দিয়েছে

source: There was an error while fetching individuals in the group
bn_bd: গ্রুপটিতে কাউকে আনার সময় ত্রুটি দেখা দিয়েছে

source: There was an error while processing the dominator tree
bn_bd: ডোমিনেটর ট্রি প্রক্রিয়াজাত করার সময় একটি ত্রুটি হয়েছে

source: There was an unexpected problem while printing.
bn_bd: মুদ্রণ করার সময় একটি অপ্রত্যাশিত সমস্যা হয়েছে।

source: There was a problem submitting your report.
bn_bd: প্রতিবেদনটি জমা দেয়ার সময় একটি সমস্যা দেখা দিয়েছে।

source: There was very low memory available.
bn_bd: এখানে খুবই কম মেমোরি উপস্থিত ছিল।

source: There were problems checking for, downloading, or installing this update. &brandShortName; could not be updated because:
bn_bd: এই হালনাগাদ অনুসন্ধান, ডাউনলোড অথবা ইনস্টল করতে সমস্যা হয়েছে। উল্লেখিত কারণে &brandShortName; হালনাগাদ করা যায়নি:

source: There were too many properties on tenured objects whose value was an object in the nursery.
bn_bd: এখানকার স্থায়ী অবজেক্টগুলোতে একের অধিক প্রপার্টি আছে যার মূল্য একটি নার্সারির অবজেক্ট।

source: The safety of your data on %S could not be guaranteed because it uses SSLv3, a broken security protocol.
bn_bd: %S-এ আপনার ডাটার সুরক্ষাকে গ্যারান্টি দেওয়া যাচ্ছে না কারণ এটি SSLv3 ব্যবহার করে, যা একটি বিশৃঙ্খল নিরাপত্তা প্রোটোকল।

source: The scope URL is invalid.
bn_bd: স্কোপ URL ভুল।

source: The scope URL must be same origin as document.
bn_bd: স্কোপ URL অবশ্যই ডকুমেন্টের মত একই অরিজিনের হতে হবে।

source: The script element has a malformed hash in its integrity attribute: “%1$S”. The correct format is “<hash algorithm>-<hash value>”.
bn_bd: স্ক্রিপ্ট উপাদানের ইন্টিগ্রিটি অ্যাট্রিবিউটে একটি নষ্ট হ্যাস রয়েছে: "%1$S"। সঠিক ফরমেট হল "<hash algorithm>-<hash value>"।

source: These add-ons have a high risk of causing stability or security problems and have been blocked, but a restart is required to disable them completely.
bn_bd: এই অ্যাড-অনগুলো ব্যবহার করলে স্থায়ীত্ব বা নিরাপত্তার ঝুঁকি থাকে, ফলে এগুলো প্রতিরোধ করা হয়েছে, কিন্তু এদেরকে পুরোপুরি নিষ্ক্রিয় করতে পুনরায় শুরু করা প্রয়োজন।

source: The search bar lets you search alternate engines directly. Choose which ones to display.
bn_bd: সার্চ বার আপনাকে বিকল্প সার্চ ইঞ্জিনে সরাসরি সার্চ করতে দেয় । কোনটি দেখাবে টা নির্বাচন করুন ।

source: The security card or token does not exist, needs to be initialized, or has been removed.
bn_bd: সিকিউরিটি কার্ড বা টোকেন উপস্থিত নেই, এটি শুরু করতে হবে, বা মুছে ফেলা হয়েছে।

source: The security password entered is incorrect.
bn_bd: উল্লেখিত নিরাপত্তামূলক পাসওয়ার্ড সঠিক নয়।

source: The selected frame
bn_bd: নির্বাচিত ফ্রেম (m)

source: The selected &frame
bn_bd: নির্বাচিত ফ্রেম (&f)

source: The _Selected Frame
bn_bd: নির্বাচিত ফ্রেম (_S)

source: The selected printer could not be found.
bn_bd: নির্বাচিত প্রিন্টারটি খুঁজে পাওয়া যায়নি।

source: The server at %S is taking too long to respond.
bn_bd: %S এর সার্ভারটি সংযোগ করতে অতিরিক্ত বেশি সময় নিচ্ছে।

source: The server certificate included a public key that was too weak.
bn_bd: সার্ভার শংসাপত্র খুব দুর্বল ছিল যে একটি পাবলিক কী অন্তর্ভুক্ত।

source: The server has encountered bad data from the client.
bn_bd: সার্ভার দ্বারা ক্লায়েন্ট থেকে ত্রুটিপূর্ণ তথ্য পেয়েছে।

source: The server might not be sending the appropriate intermediate certificates.
bn_bd: সার্ভারটি হয়ত যথাযথ মধ্যবর্তী সার্টিফিকেট পাঠাচ্ছেনা।

source: The server presented a certificate that contains an invalid encoding of an integer. Common causes include negative serial numbers, negative RSA moduli, and encodings that are longer than necessary.
bn_bd: সার্ভার একটি সার্টিফিকেট উপস্থাপন করছে যাতে ইন্টিজারের একটি অকার্যকর এনকোডিং রয়েছে। সাধারণ কারণ হতে পারে ঋণাত্মক সিরিয়াল নাম্বার, ঋণাত্মক RSA moduli, এবং প্রয়োজনের চেয়ে লম্বা এনকোডিং।

source: The server presented a certificate that is not yet valid.
bn_bd: সার্ভার এখন পর্যন্ত বৈধ নয় যে একটি শংসাপত্র উপস্থাপন করেছে।

source: The server presented a certificate that is valid for too long.
bn_bd: সার্ভার খুব দীর্ঘ জন্য বৈধ নয় যে একটি শংসাপত্র উপস্থাপন করেছে।

source: The server presented a certificate with a key size that is too small to establish a secure connection.
bn_bd: সার্ভার একটি নিরাপদ সংযোগ স্থাপন করার খুব ছোট যে কী আকার সঙ্গে একটি শংসাপত্র উপস্থাপন করেছে।

source: The server presented a certificate with an empty issuer distinguished name.
bn_bd: সার্ভারটি এমন একটি সার্টিফিকেট উপস্থাপন করেছে, যেখানে আলাদা করে খালি ইস্যুকারীর নাম রয়েছে।

source: The server rejected the handshake because the client downgraded to a lower TLS version than the server supports.
bn_bd: ক্লায়েন্ট এবং সার্ভার সমর্থন কম TLS সংস্করণে পর্যবসিত কারণ সার্ভার হ্যান্ডশেক প্রত্যাখ্যাত।

source: The server supports no protocols that the client advertises in the ALPN extension.
bn_bd: সার্ভার ক্লায়েন্ট ALPN এক্সটেনশন advertises যে কোন প্রোটোকল সমর্থন করে।

source: The server uses a certificate with a basic constraints extension identifying it as a certificate authority. For a properly-issued certificate, this should not be the case.
bn_bd: সার্ভার একটি সার্টিফিকেট অথোরিটি হিসাবে এটি চিহ্নিত একটি মৌলিক সীমাবদ্ধতা এক্সটেনশন সহ একটি সার্টিফিকেট ব্যবহার করে. একটি সঠিকভাবে জারি সার্টিফিকেটের জন্য, এই ক্ষেত্রে করা উচিত।

source: The server uses key pinning (HPKP) but no trusted certificate chain could be constructed that matches the pinset. Key pinning violations cannot be overridden.
bn_bd: সার্ভার কী পিন (HPKP) ব্যবহার করে কিন্তু কোন বিশ্বস্ত শংসাপত্র শৃঙ্খল pinset সাথে মিলে যায় যে নির্মাণ করা যেতে পারে. কী পিন লঙ্ঘনের উপেক্ষা করা যাবে না।

source: The Services are provided &quot;as-is.&quot; &vendorShortName;, its contributors, licensors, and distributors, disclaim all warranties, whether express or implied, including without limitation, warranties that the Services are merchantable and fit for your particular purposes. You bear the entire risk as to selecting the Services for your purposes and as to the quality and performance of the Services. Some jurisdictions do not allow the exclusion or limitation of implied warranties, so this disclaimer may not apply to you.
bn_bd: সেবাগুলো প্রদান করা হয় &quot;যেমন আছে&quot; &vendorShortName;, এর অবদানকারী, লাইসেন্স প্রদানকারী এবং পরিবেশক, যেকোন প্রকার সুস্পষ্ট বা নিহিত ওয়ারেন্টি, এই পণ্য বানিজ্যিকভাবে বা আপনার প্রয়োজন মেটাতে ব্যবহারযোগ্য, এ সম্পর্কিত সব ওয়ারেন্টি থেকেও। সেবা নির্বাচন থেকে শুরু করে তার মান সম্পর্কিত সব ঝুঁকিই আপনার। কিছু এলাকার ক্ষেত্রে নিহিত ওয়ারেন্টি বাতিল বা সীমিত করা তাদের এখতিয়ারের বাইরে, তাই, এই ঘোষনাটি আপনার জন্য প্রযোজ্য নাও হতে পারে।

source: The ServiceWorker for scope ‘%1$S’ failed to decrypt a push message. For help with encryption, please see https://developer.mozilla.org/docs/Web/API/Push_API/Using_the_Push_API#Encryption
bn_bd: স্কোপ ‘%1$S’ এর ServiceWorker পুস বার্তা ডিক্রিপ্ট করতে ব্যর্থ হয়েছে। এনক্রিপশন সম্পর্কিত সাহায্যের জন্য, অনুগ্রহ করে দেখুন https://developer.mozilla.org/docs/Web/API/Push_API/Using_the_Push_API#Encryption

source: These terms are governed by the laws of the state of California, U.S.A., excluding its conflict of law provisions. If any portion of these terms is held to be invalid or unenforceable, the remaining portions will remain in full force and effect. In the event of a conflict between a translated version of these terms and the English language version, the English language version shall control.
bn_bd: আইনের বিরোধ সংক্রান্ত অংশ ব্যতিরেকে, এই শর্তসমূহ যুক্তরাষ্ট্রের ক্যালিফোর্নিয়া স্টেটের আইন অনুযায়ী নিয়ন্ত্রিত। এই শর্তসমূহের কোনো অংশ অবৈধ বা অগ্রহণযোগ্য হলেও, বাকি অংশ সম্পূর্ণভাবে কার্যকর থাকবে। যদি ইংরেজি সংস্করণ এবং অনুবাদকৃত সংস্করণের মধ্যে কোনো বিরোধ থাকে, তাহলে ইংরেজি সংস্করণটি অগ্রাধিকার পাবে।

source: The SETTINGS section may only contain a single value, “prefer-online” or “fast” at line %S.
bn_bd: SETTINGS সেকশনের %S লাইনে শুধুমাত্র একটি মান "prefer-online" অথবা "fast" থাকবে।

source: These updates can’t be installed because software installation is currently disabled. You can change this setting below.
bn_bd: সফটওয়্যার ইনস্টলেশন নিষ্ক্রিয় থাকার ফলে এই হালনাগাদগুলো ইনস্টল করা সম্ভব নয়। নিম্নলিখিত স্থানে এই সেটিং পরিবর্তন করা যাবে।

source: The signature algorithm in the signature field of the certificate does not match the algorithm in its signatureAlgorithm field.
bn_bd: সার্টিফিকেটের স্বাক্ষর স্বাক্ষর ক্ষেত্রের অ্যালগরিদম তার signatureAlgorithm ক্ষেত্রের অ্যালগরিদম মেলে না।

source: The signer of the OCSP response is not authorized to give status for this certificate.
bn_bd: OCSP উত্তর সাক্ষরকারী এই সার্টিফিকেটের অবস্থা দেয়ার জন্য অনুমোদিত নয়।

source: The signer’s certificate could not be found.
bn_bd: সাক্ষরকারীর সার্টিফিকেট পাওয়া যায়নি।

source: The site at %S has been reported as an attack site and has been blocked based on your security preferences.
bn_bd: %S এ বিদ্যমান সাইটটি একটি আক্রমণকারী সাইট হিসেবে চিহ্নিত করা হয়েছে এবং আপনার নির্ধারিত নিরাপত্তা পছন্দসমূহের বৈশিষ্ট্যের উপর ভিত্তি করে এর প্রদর্শন রোধ করা হয়েছে।

source: The site at %S has been reported as serving unwanted software and has been blocked based on your security preferences.
bn_bd: %S এর সাইটটি একটি অপ্রয়োজনীয় সাইট হিসেবে চিহ্নিত এবং আপনার নিরাপত্তার বৈশিষ্ট্য অনুযায়ী এটি প্রতিরোধ করা হয়েছে।

source: The site at %S has experienced a network protocol violation that cannot be repaired.
bn_bd: %S এর সাইটে একটি নেটওয়ার্ক প্রোটোকল লঙ্ঘিত হয়েছে, যা মেরামত করা যাবে না।

source: The size of the object itself
bn_bd: অবজেক্টের নিজের আকার

source: The specified line was not found.
bn_bd: উল্লিখিত লাইনটি পাওয়া যায়নি।

source: The specified page has no manifest.
bn_bd: বিশেষায়িত পেইজটির কোন ম্যানিফেস্ট নেই

source: The %S plugin has crashed.
bn_bd: %S প্লাগইন ক্র্যাশ করেছে।

source: The start URL is invalid.
bn_bd: শুরুর URL ভুল।

source: The start URL is outside the scope, so the scope is invalid.
bn_bd: স্টার্ট URL স্কোপের বাইরে, তাই স্কোপটি ভুল।

source: The start URL must be same origin as document.
bn_bd: স্টার্ট URL অবশ্যই ডকুমেন্টের মত একই অরিজিনের হতে হবে।

source: The string following “&” was interpreted as a character reference. (“&” probably should have been escaped as “&amp;”.)
bn_bd: নিম্নোক্ত স্ট্রিং “&” অক্ষর রেফারেন্স হিসেবে ব্যাখ্যা প্রদান করেছিল।( সম্ভবত “&amp;” হিসেবে “&” এর এস্কেপ করা উচিৎ।)
